In [1]:
from jeda import Jeda
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
titanic = sns.load_dataset("titanic")

In [3]:
df = titanic[['sex','age','sibsp','parch','fare','class','deck','embark_town','alive']].copy()

In [4]:
df['rand'] = np.random.choice(range(11),len(df))

In [5]:
j = Jeda(data=df)
j

Jeda(columns=[{'name': 'sex', 'type': 'discrete', 'na': 0, 'values': ['female', 'male'], 'counts': [314, 577],…

In [26]:
j.data = sns.load_dataset('titanic')

In [7]:
j.data

        sex   age  sibsp  parch     fare   class deck  embark_town alive  rand
0      male  22.0      1      0   7.2500   Third  NaN  Southampton    no     2
1    female  38.0      1      0  71.2833   First    C    Cherbourg   yes     2
2    female  26.0      0      0   7.9250   Third  NaN  Southampton   yes     6
3    female  35.0      1      0  53.1000   First    C  Southampton   yes     2
4      male  35.0      0      0   8.0500   Third  NaN  Southampton    no     2
..      ...   ...    ...    ...      ...     ...  ...          ...   ...   ...
886    male  27.0      0      0  13.0000  Second  NaN  Southampton    no     0
887  female  19.0      0      0  30.0000   First    B  Southampton   yes     4
888  female   NaN      1      2  23.4500   Third  NaN  Southampton    no    10
889    male  26.0      0      0  30.0000   First    C    Cherbourg   yes     5
890    male  32.0      0      0   7.7500   Third  NaN   Queenstown    no     7

[891 rows x 10 columns]